In [1]:
import pandas as pd  # import pandas libraries

In [2]:
import numpy as np    # import numpy libraries

In [66]:
df = pd.read_csv(r"C:\Users\44754\Documents\tempfile.csv")

In [67]:
df.head(10)  # to see top 5 rows

   EmployeeID Firstname     Lastname  Salary  Jobtitle     SEX  Age
0           1   Hasnain  Lokhandwala   25000   Manager    Male   31
1           2      Ibtu  Lokhandwala   29000   Manager  Female   27
2           3  Zulfikar         Khan   32000  Employee    Male   30
3           4    Fatema        shekh   29000  Employee  Female   27
4           5     zenab  lokhandwala   32000       CEO    Male   41

In [68]:
df.tail()

   EmployeeID Firstname     Lastname  Salary  Jobtitle     SEX  Age
0           1   Hasnain  Lokhandwala   25000   Manager    Male   31
1           2      Ibtu  Lokhandwala   29000   Manager  Female   27
2           3  Zulfikar         Khan   32000  Employee    Male   30
3           4    Fatema        shekh   29000  Employee  Female   27
4           5     zenab  lokhandwala   32000       CEO    Male   41

In [8]:
# accessing a single column

In [69]:
    df.head(2)

   EmployeeID Firstname     Lastname  Salary Jobtitle     SEX  Age
0           1   Hasnain  Lokhandwala   25000  Manager    Male   31
1           2      Ibtu  Lokhandwala   29000  Manager  Female   27

In [10]:
# add newrow data
newrow = {'EmployeeID' :6,'Firstname':'Ahmedi','Lastname':'Hajari', 'Salary': 31000, 'Jobtitle':'MBA','SEX': 'Male','Age':33}

In [11]:
newrowdf = pd.DataFrame([newrow])

In [71]:
# add newrow data into dataframed
df = pd.concat([df,newrowdf],ignore_index = True)

In [72]:
print(df)

   EmployeeID Firstname     Lastname  Salary  Jobtitle     SEX  Age
0           1   Hasnain  Lokhandwala   25000   Manager    Male   31
1           2      Ibtu  Lokhandwala   29000   Manager  Female   27
2           3  Zulfikar         Khan   32000  Employee    Male   30
3           4    Fatema        shekh   29000  Employee  Female   27
4           5     zenab  lokhandwala   32000       CEO    Male   41
5           6    Ahmedi       Hajari   31000       MBA    Male   33

In [73]:
df.head(10)

   EmployeeID Firstname     Lastname  Salary  Jobtitle     SEX  Age
0           1   Hasnain  Lokhandwala   25000   Manager    Male   31
1           2      Ibtu  Lokhandwala   29000   Manager  Female   27
2           3  Zulfikar         Khan   32000  Employee    Male   30
3           4    Fatema        shekh   29000  Employee  Female   27
4           5     zenab  lokhandwala   32000       CEO    Male   41
5           6    Ahmedi       Hajari   31000       MBA    Male   33

In [74]:
df.describe() # summary of statatistics

       EmployeeID        Salary        Age
count    6.000000      6.000000   6.000000
mean     3.500000  29666.666667  31.500000
std      1.870829   2658.320272   5.205766
min      1.000000  25000.000000  27.000000
25%      2.250000  29000.000000  27.750000
50%      3.500000  30000.000000  30.500000
75%      4.750000  31750.000000  32.500000
max      6.000000  32000.000000  41.000000

In [16]:
print(df.shape) # no of rows and columns

(6, 7)

In [18]:
print(df['Firstname'])  # access column by name

0     Hasnain
1        Ibtu
2    Zulfikar
3      Fatema
4       zenab
5      Ahmedi
Name: Firstname, dtype: object

In [19]:
 print(df[['Firstname','Lastname']])

  Firstname     Lastname
0   Hasnain  Lokhandwala
1      Ibtu  Lokhandwala
2  Zulfikar         Khan
3    Fatema        shekh
4     zenab  lokhandwala
5    Ahmedi       Hajari

In [416]:
print(df[df['Salary'] >31000])  #  check salary moretahn 31000

   EmployeeID Firstname     Lastname  Salary  Jobtitle   SEX  Age
2           3  Zulfikar         Khan   32000  Employee  Male   30
4           5     zenab  lokhandwala   32000       CEO  Male   41

In [20]:
print(df.isnull().sum()) # checking null value

EmployeeID    0
Firstname     0
Lastname      0
Salary        0
Jobtitle      0
SEX           0
Age           0
dtype: int64

In [21]:
#   Numpy

In [22]:
data = df.to_numpy()

In [23]:
print(data)

[[1 'Hasnain' 'Lokhandwala' 25000 'Manager' 'Male' 31]
 [2 'Ibtu' 'Lokhandwala' 29000 'Manager' 'Female' 27]
 [3 'Zulfikar' 'Khan' 32000 'Employee' 'Male' 30]
 [4 'Fatema' 'shekh' 29000 'Employee' 'Female' 27]
 [5 'zenab' 'lokhandwala' 32000 'CEO' 'Male' 41]
 [6 'Ahmedi' 'Hajari' 31000 'MBA' 'Male' 33]]

In [24]:
salary = df['Salary'].to_numpy()  # for salary

In [25]:
print(salary)

[25000 29000 32000 29000 32000 31000]

In [26]:
age = df['Age'].to_numpy()

In [29]:
print(age)

[31 27 30 27 41 33]

In [30]:
newsalary = salary * 1.10
print('New salary by 10 percent hike', newsalary)

New salary by 10 percent hike [27500. 31900. 35200. 31900. 35200. 34100.]

In [31]:
# increment salary 20 percent whose job title  = manager
df['Salary'] = np.where(df['Jobtitle'] =='Manager', df['Salary'] * 1.20, df['Salary'])

In [75]:
print(df)

   EmployeeID Firstname     Lastname  Salary  Jobtitle     SEX  Age
0           1   Hasnain  Lokhandwala   25000   Manager    Male   31
1           2      Ibtu  Lokhandwala   29000   Manager  Female   27
2           3  Zulfikar         Khan   32000  Employee    Male   30
3           4    Fatema        shekh   29000  Employee  Female   27
4           5     zenab  lokhandwala   32000       CEO    Male   41
5           6    Ahmedi       Hajari   31000       MBA    Male   33

In [65]:
# creating retirement (new column)
retirementage = 50
df['yearretirement'] = np.where(df['Age'] < retirementage, retirementage - df['Age'],0)
print(df)

Empty DataFrame
Columns: [EmployeeID, Firstname, Lastname, Salary, Jobtitle, SEX, Age, yearretirement]
Index: []

In [457]:
# sql

In [34]:
pip install sqlalchemy

Collecting sqlalchemyNote: you may need to restart the kernel to use updated packages.

  Downloading SQLAlchemy-2.0.36-cp313-cp313-win_amd64.whl.metadata (9.9 kB)
Collecting typing-extensions>=4.6.0 (from sqlalchemy)
  Using cached typing_extensions-4.12.2-py3-none-any.whl.metadata (3.0 kB)
Downloading SQLAlchemy-2.0.36-cp313-cp313-win_amd64.whl (2.1 MB)
   ---------------------------------------- 0.0/2.1 MB ? eta -:--:--
   ------------------------- -------------- 1.3/2.1 MB 7.1 MB/s eta 0:00:01
   ---------------------------------------- 2.1/2.1 MB 6.0 MB/s eta 0:00:00
Using cached typing_extensions-4.12.2-py3-none-any.whl (37 kB)
Installing collected packages: typing-extensions, sqlalchemy
Successfully installed sqlalchemy-2.0.36 typing-extensions-4.12.2

[notice] A new release of pip is available: 24.2 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [76]:
import pandas as pd 
from sqlalchemy import create_engine

In [77]:
df.head()

   EmployeeID Firstname     Lastname  Salary  Jobtitle     SEX  Age
0           1   Hasnain  Lokhandwala   25000   Manager    Male   31
1           2      Ibtu  Lokhandwala   29000   Manager  Female   27
2           3  Zulfikar         Khan   32000  Employee    Male   30
3           4    Fatema        shekh   29000  Employee  Female   27
4           5     zenab  lokhandwala   32000       CEO    Male   41

In [78]:
import mysql.connector

In [79]:
pip install mysql-connector-python

Note: you may need to restart the kernel to use updated packages.Requirement already satisfied: mysql-connector-python in c:\users\44754\appdata\local\programs\python\python313\lib\site-packages (9.1.0)

[notice] A new release of pip is available: 24.2 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [80]:
dbconnection = mysql.connector.connect( host = 'localhost', user = 'root', password = 'root', database = 'challenge1')

In [81]:
cursor = dbconnection.cursor()

In [82]:
query = 'select * from employee1'
cursor.execute(query)

In [83]:
rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]

In [84]:
print(rows)

[(1, 'Hasnain', 'Lokhandwala', 25000, 'Manager', 'Male', 31), (2, 'Ibtu', 'Lokhandwala', 29000, 'Manager', 'Female', 27), (3, 'Zulfikar', 'Khan', 32000, 'Employee', 'Male', 30), (4, 'Fatema', 'shekh', 29000, 'Employee', 'Female', 27), (5, 'zenab', 'lokhandwala', 32000, 'CEO', 'Male', 41)]

In [85]:
# Convert to Pandas DataFrame
df = pd.DataFrame(rows, columns=columns)

In [86]:
pip install pymysql

Requirement already satisfied: pymysql in c:\users\44754\appdata\local\programs\python\python313\lib\site-packages (1.1.1)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.2 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [87]:
# Step 2: Upload DataFrame to Another Table
# Create SQLAlchemy engine for the database
engine = create_engine('mysql+pymysql://root:root@localhost/challenge1')

In [88]:
df.to_sql('employee_backup', con=engine, if_exists='replace', index=False)

5

In [89]:
print(df)

   EmployeeID Firstname     Lastname  Salary  Jobtitle     SEX  Age
0           1   Hasnain  Lokhandwala   25000   Manager    Male   31
1           2      Ibtu  Lokhandwala   29000   Manager  Female   27
2           3  Zulfikar         Khan   32000  Employee    Male   30
3           4    Fatema        shekh   29000  Employee  Female   27
4           5     zenab  lokhandwala   32000       CEO    Male   41